# language: ru
Функционал: check_transitions_links_buttons
  Описание: проверка работоспособности кнопок, ссылок и переходов

 Сценарий: №1 проверка главной страницы
   Допустим пользователь открывает сайт
   Если нажать кнопку "Кабинет"
   То откроется модальное окно авторизации
   Если поля ввести валидные данные
   Тогда будет выполнен вход на сайт как авторизированный пользователь
   Если нажать ссылку "О компании"
   То откроется страница с описанием компании
   Если нажать кнопку "Назад"
   То откроется главная страница
   Если нажать кнопку "Калькулятор доставки"
   То откроется страница расчета доставки
   Если нажать кнопку "Назад"
   То откроется главная страница
   Если нажать кнопку "Контакты"
   То откроется страница контактных данных компании
   Если нажать кнопку "Назад"
   То откроется главная страница
   Если нажать кнопку "Оплата"
   То откроется страница с вариантами оплаты
   Если нажать кнопку "Назад"
   То откроется главная страница
   Если нажать кнопку "Оптовикам и Юр Лицам"
   То откроется страница личного кабинета
   Если нажать кнопку "Назад"
   То откроется главная страница
   Если нажать кнопку "Производители"
   То откроется страница производителей товаров
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим нажать на номер телефона
   Тогда откроется пустая вклада на настольной версии, а в мобильной откроется телефон с номером компании

 Сценарий: №2 проверка главной страницы (блок "Каталог товаров")
   Дано главная страница сайта
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Сухие смеси"
   Тогда откроется страница раздела "Сухие смеси"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Клей"
   Тогда откроется страница раздела "Клей"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Изоляционные материалы"
   Тогда откроется страница раздела "Изоляционные материалы"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Напольные покрытия"
   Тогда откроется страница раздела "Напольные покрытия"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Листовые материалы"
   Тогда откроется страница раздела "Листовые материалы"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Монтажный инструмент"
   Тогда откроется страница раздела "Монтажный инструмент"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Древесно-Плитные материалы"
   Тогда откроется страница раздела "Древесно-Плитные материалы"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Блоки строительные"
   Тогда откроется страница раздела "Блоки строительные"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Сетки"
   Тогда откроется страница раздела "Сетки"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Пены и герметики"
   Тогда откроется страница раздела "Пены и герметики"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Кровельные материалы"
   Тогда откроется страница раздела "Кровельные материалы"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Хозяйственные товары"
   Тогда откроется страница раздела "Хозяйственные товары"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Полиэтиленовые пленки"
   Тогда откроется страница раздела "Полиэтиленовые пленки"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Лакокрасочные материалы"
   Тогда откроется страница раздела "Лакокрасочные материалы"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Строительные обои"
   Тогда откроется страница раздела "Строительные обои"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Теплые полы"
   Тогда откроется страница раздела "Теплые полы"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Электроинструменты"
   Тогда откроется страница раздела "Электроинструменты"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Каталог товаров"
   Когда нажмем кнопку "Металл"
   Тогда откроется страница раздела "Металл"
   Если нажать кнопку "Назад"
   То откроется главная страница

 Сценарий: №3 проверка главной страницы (блок "Футер")
   Дано главная страница сайта
   Допустим в разделе "Футер"
   Когда нажмем ссылку "Политика конфиденциальности"
   Тогда откроется страница "Политика конфиденциальности"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Футер"
   Когда нажмем ссылку "Условия соглашения"
   Тогда откроется страница "Условия соглашения"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Футер"
   Когда нажмем ссылку "Акции"
   Тогда откроется страница "Акции"
   Если нажать кнопку "Назад"
   То откроется главная страница
   Допустим в разделе "Футер"
   Когда нажмем ссылку "Карта сайта"
   Тогда откроется страница "Карта сайта"
   Если нажать кнопку "Назад"
   То откроется главная страница

